
{
    "basics": {
        "name": "Ramon Gebben",
        "label": "Frontend Developer",
        "picture": "http://i.imgur.com/vu6XhzL.jpg",
        "email": "ramon@ra-ge.net",
        "phone": "+316 30 97 85 40",
        "website": "http://ramon-gebben.ninja",
        "birthday": "1991-08-07",
        "summary": "I am a 24 years young passionate front-end developer using HTML(5), CSS(Next)/SCSS/LESS/PostCSS, JavaScript(ESNext, Coffee and Vanilla, TypeScript), and Node.js for backend. In my free time I maintain a website called Daily-Javascript.com, where I mention a new libraries or major changes in the JavaScript community. Besides that I love building on API's with frameworks such as Hapi.js, Koa, Express and just plain Node. When building web application with user interfaces my weapon of choice is React, but I also had a lot of fun with Riot and Vue. I am looking for a job at an amazing company where we can work with bleeding edge technologies and where we can contribute on pushing Javascript and the web to the next level. Furthermore I like to learn more about functional programming, since I'm noticing that this is the easiest way to make scalable and predictable applications. So a company that would embrace these principles would be an amazing environment for me to become a better developer.",
        "location": {
            "address": "Korfoedreef 177",
            "postalCode": "3562 SK",
            "city": "Utrecht",
            "countryCode": "NL",
            "region": "Utrecht"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "Ramon Gebben",
                "url": "https://nl.linkedin.com/in/ramon-gebben-88039b85"
            },
            {
                "network": "Twitter",
                "username": "DailyJavascript",
                "url": "https://twitter.com/DailyJavascript"
            },
            {
                "network": "Github",
                "username": "RamonGebben",
                "url": "https://github.com/RamonGebben"
            },
            {
                "network": "Bitbucket",
                "username": "RamonGebben",
                "url": "https://bitbucket.org/RamonGebben"
            }
        ]
    },
    "work": [
        {
            "company": "TouchTribe",
            "position": "Frontend Developer",
            "website": "http://touchtribe.nl",
            "startDate": "2015-07-06",
            "summary": "At TouchTribe I mainly work on one project. This was a photo-book app for a very large vendor. This was a hybrid app. I came into this in the proof of concept phase the project and it will be in the app store's soon. For this project we wrote our own framework on top of Cordova. In order to keep the performance as best as we could we needed to minimize the usage of libraries and optimize every bit of JavaScript. My responsibilities in this project very diverse. From styling to continuous integration. The styling we did with LESS. The naming conventions of classes where very similar to those of BEM but not strongly enforced. For the continuous integration we are using Jenkins together with a custom web hook proxy for handling merges and releases. As a task runner we used gulp and some custom build scripts to handle the native part.",
            "highlights": [
                "Setup continuous integration",
                "Created chat bot for running builds on command",
                "Developed hybrid photo-book app"
            ]
        },
        {
            "company": "Qelp",
            "position": "Frontend Developer",
            "website": "http://qelp.com",
            "startDate": "2014-08-06",
            "endDate": "2015-06-06",
            "summary": "Qelp is a company that provides smartphone help to non technical people. With QelpCare you can offer your customers 24/7 support through the channel of their liking and availability: online, mobile, retail, call center and even if they search for help using Google. Picture based tutorials, one-click fix and remote diagnostics are available to resolve complex issues or educate about new functions to increase your revenues per user. We worked with Coffeescript for the frontend and the backend was written in PHP.",
            "highlights": [
                "Developed a device emulator for the webbrowser. To mimic every phone. This is build with a nodejs server running Express.js and used jQuery in the browser for the rest.",
                "A webclient generator to scrape a website replace the content with a standard client so it looks like custom trail application within 1 click. This was also created with Express.js and some jQuery in the browser. For styles I tried Semantic UI.",
                "Created Tranzilla, an application to crawl the API and spellcheck every word served to a client. This is an application written in nodejs, with modules such as Lodash, Q(Promise) and Mocha with Chai for tests. The interface for the project was provided via Electron(by Atom)."
            ]
        },
        {
            "company": "Mindful Meerkats",
            "position": "Lead Developer",
            "website": "http://mindful-meerkats.org",
            "startDate": "2014-09-11",
            "summary": "At Mindful Meerkats I was responsible for planning, engineering and developing their entire system. This changed when I got to busy with the weekly Meetup, Daily-Javascript and full time day job. Now I advice and guide the less experienced developers who are volunteering for the experience. The platform we build is a game to make you more "mindful" of your environment and your own health. Their backend API is build using Hapi.js and authorization is done with JSON Web Tokens and Rethinkdb as a database. The CMS they use for inputting data like quests was build using React.js. The first version of the game/client was build using only JavaScript and a canvas element. But the second version is being build using Phaser.js.",
            "highlights": [
                "Created API with Hapi.js, Rethinkdb and JSON WebTokens",
                "Created CMS with React.js",
                "Creating the game scene with Phaser.js"
            ]
        },
        {
            "company": "Ra-Ge.NET",
            "position": "Owner",
            "website": "http://ra-ge.net",
            "startDate": "2012-12-01",
            "summary": "Ra-Ge.NET is the company I started so I could start working as a freelancer. Now it mainly just publishes tools and maintains websites and apps that where build in that past.",
            "highlights": [
              "Reached 10 customers",
              "Created Devstar server environment",
              "Created Cquence animation library"
            ]
        },
        {
            "company": "Owlin",
            "position": "Frontend developer",
            "website": "http://owlin.com",
            "startDate": "2013-02-01",
            "summary": "At this company I was allowed to intern after I walked in asking to learn how to code.",
            "highlights": []
        },
        {
            "company": "Various Kitchens",
            "position": "Chef",
            "website": "",
            "startDate": "2012-09-01",
            "endDate": "2013-07-01",
            "summary": "After my training as a chef I quickly fought my way up the ladder to become a sous-chef( second man ) and started to lead a team of 2.",
            "highlights": [
                "Introduced serveral new dishes by various kitchens.",
                "Became a sous-chef"
            ]
        }
    ],
    "volunteer": [
        {
            "organization": "Saterday Morning Coding Utrecht",
            "position": "Coörganizer",
            "website": "http://www.meetup.com/Saturday-Morning-Coding-Utrecht/",
            "startDate": "2013-05-05",
            "summary": "This is a small community I joined some time ago. It's not more then a bunch of nice people with a passion for code. We get together every Saturday morning to drink coffee and work on projects, together or on your own project anything goes. Nowadays people come with questions about learning code so we are also working on some learning materials for people who wanna make a start at learning code.",
            "highlights": [
                "Won the 2014 Green Hackfest Utrecht."
            ]
        }
    ],
    "awards": [
        {
            "title": "First place visualising sustainability",
            "date": "2014-10-12",
            "awarder": "Green Hackfest Utrecht",
            "summary": "For this event me and my team made an better solution for using electronic car charging stations. This solution was taking a lot of measurements such as CO2 particles, heat and charging levels of the car. With these measurements we could calculate when a car could be moved and send notifications the the owner of the car to move it."
        }
    ],
    "skills": [
        {
            "name": "Web Development",
            "keywords": [
                "HTML5",
                "Javascript",
                "Node",
                "CSS(3)",
                "LESS",
                "SCSS",
                "Ruby"
            ]
        },
        {
            "name": "Frameworks",
            "keywords": [
                "React",
                "EmberJS",
                "Riot",
                "Vue",
                "Express",
                "Koa",
                "Sails",
                "Rails",
                "Sinatra"
            ]
        },
        {
            "name": "Task runners",
            "keywords": [
                "npm",
                "Gulp",
                "Yeoman",
                "Grunt"
            ]
        },
        {
            "name": "Build tools",
            "keywords": [
                "Webpack",
                "Browserify"
            ]
        },
        {
            "name": "Testing",
            "keywords": [
                "Mocha",
                "Chai",
                "QUnit",
                "Jasmine"
            ]
        },
        {
            "name": "System languages",
            "keywords": [
                "BaSH",
                "FiSH",
                "Node",
                "Ruby"
            ]
        }
    ],
  "education": [
    {
      "institution": "ICT Acedemy Utrecht",
      "area": "System Administration",
      "studyType": "MBO",
      "startDate": "2013-09-01",
      "endDate": "2014-03-01",
      "courses": [
        "Networking",
        "Webhosts",
        "ActiveDirectory",
        "Linux"
      ]
    },
    {
      "institution": "Leerhotel het Klooster",
      "area": "Chef de party",
      "studyType": "MBO",
      "startDate": "2011-09-01",
      "endDate": "2013-06-01",
      "courses": [
        "Specialisation in Pastry",
        "Specialisation in Chocolatery",
        "Specialisation in Vegetables"
      ]
    }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Fluent"
        },
        {
            "language": "Dutch",
            "fluency": "Native speaker"
        }
    ],
    "interests": [
        {
            "name": "Pet projets",
            "keywords": [
                "Maintaining Daily-Javascript",
                "Building web apps",
                "Making and explorings applications such as build tools and other handy tools. ",
                "Building and flying drones"
            ]
        },
        {
            "name": "Music",
            "keywords": [
                "Dubstep",
                "Drum'n'bass",
                "Chiptune",
                "Rock"
            ]
        }
    ]
}
